{"format": "layers-model", "generatedBy": "keras v2.0.6", "convertedBy": "TensorFlow.js Converter v3.7.0", "modelTopology": {"keras_version": "2.0.6", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": [{"class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d_1", "trainable": true, "batch_input_shape": [null, 5, 5, 2048], "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.3}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "units": 133, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "training_config": {"optimizer_config": {"class_name": "RMSprop", "config": {"lr": 0.0010000000474974513, "rho": 0.8999999761581421, "decay": 0.0, "epsilon": 1e-08}}, "loss": "categorical_crossentropy", "metrics": ["accuracy"], "sample_weight_mode": null, "loss_weights": null}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "dense_1/kernel", "shape": [2048, 133], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [133], "dtype": "float32"}]}]}